In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Al", "Bhosdu", "Babblu"], 
    "last": ["Singh", "Lullu", "Capone"],
    "email": ["as@gmal.com", "bl@email.com", "bs@email.com"]
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first    last         email
0      Al   Singh   as@gmal.com
1  Bhosdu   Lullu  bl@email.com
2  Babblu  Capone  bs@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ["first_name", "last_name", "email_id"]

In [7]:
df

  first_name last_name      email_id
0         Al     Singh   as@gmal.com
1     Bhosdu     Lullu  bl@email.com
2     Babblu    Capone  bs@email.com

In [8]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME      EMAIL_ID
0         Al     Singh   as@gmal.com
1     Bhosdu     Lullu  bl@email.com
2     Babblu    Capone  bs@email.com

In [9]:
df.columns = df.columns.str.replace("_","-")
df

  FIRST-NAME LAST-NAME      EMAIL-ID
0         Al     Singh   as@gmal.com
1     Bhosdu     Lullu  bl@email.com
2     Babblu    Capone  bs@email.com